Revit 2024 API
StructuralSectionGeneralCEx.FoldLength Property
 Fold segment length.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public double FoldLength { get; set; }
Visual Basic
Public Property FoldLength As Double
	Get
	Set
Visual C++
public:
property double FoldLength {
	double get ();
	void set (double value);
}
See Also
StructuralSectionGeneralCEx Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace